Public Attributes | List of all members
API_GridMeshPolygon Struct Reference
Element Manager API
A 3D mesh polygon with four edge indices. More...
#include <APIdefs_Base.h>
 Public Attributes
API_GridMeshHead  | head
General Grid Mesh header.
GS::Array< API_GridElemID >  | neighbourIDs [API_GridMeshDirNum]
API_GridEdgeInfo  | edges [4]
Edge indices of the grid mesh polygon.
Detailed Description
A 3D mesh polygon with four edge indices.
Remarks
For more information see API_GridMesh.
Member Data Documentation
◆ edges
 API_GridMeshPolygon::edges
Edge indices of the grid mesh polygon.
◆ head
 API_GridMeshPolygon::head
General Grid Mesh header.
◆ neighbourIDs
 GS::Array<API_GridElemID> API_GridMeshPolygon::neighbourIDs[API_GridMeshDirNum]